# FabricationPartDoublewallMaterialThickness Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FabricationPartDoublewallMaterialThickness Property
ParameterTypeId Class See Also
---
"Double Wall Material Thickness"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FabricationPartDoublewallMaterialThickness { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FabricationPartDoublewallMaterialThickness As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FabricationPartDoublewallMaterialThickness {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace